Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_jh_vl_cnano/pic32cm_jh_vl_cnano_mikroe_click/mcp25625/firmware/src/packs/PIC32CM6408JH00064_DFP/component/hmatrixb.h
/*
 * Component description for HMATRIXB
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2022-03-14T06:27:59Z  */
#ifndef _PIC32CMJH00_HMATRIXB_COMPONENT_H_
#define _PIC32CMJH00_HMATRIXB_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                    SOFTWARE API DEFINITION FOR HMATRIXB                    */
/* ************************************************************************** */

/* -------- HMATRIXB_PRAS : (HMATRIXB Offset: 0x00) (R/W 32) Priority A for Slave -------- */
#define HMATRIXB_PRAS_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIXB_PRAS) Priority A for Slave  Reset Value */

#define HMATRIXB_PRAS_M0PR_Pos                _UINT32_(0)                                          /* (HMATRIXB_PRAS) Master 0 Priority Position */
#define HMATRIXB_PRAS_M0PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M0PR_Pos)            /* (HMATRIXB_PRAS) Master 0 Priority Mask */
#define HMATRIXB_PRAS_M0PR(value)             (HMATRIXB_PRAS_M0PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M0PR_Pos)) /* Assignment of value for M0PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M1PR_Pos                _UINT32_(4)                                          /* (HMATRIXB_PRAS) Master 1 Priority Position */
#define HMATRIXB_PRAS_M1PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M1PR_Pos)            /* (HMATRIXB_PRAS) Master 1 Priority Mask */
#define HMATRIXB_PRAS_M1PR(value)             (HMATRIXB_PRAS_M1PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M1PR_Pos)) /* Assignment of value for M1PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M2PR_Pos                _UINT32_(8)                                          /* (HMATRIXB_PRAS) Master 2 Priority Position */
#define HMATRIXB_PRAS_M2PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M2PR_Pos)            /* (HMATRIXB_PRAS) Master 2 Priority Mask */
#define HMATRIXB_PRAS_M2PR(value)             (HMATRIXB_PRAS_M2PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M2PR_Pos)) /* Assignment of value for M2PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M3PR_Pos                _UINT32_(12)                                         /* (HMATRIXB_PRAS) Master 3 Priority Position */
#define HMATRIXB_PRAS_M3PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M3PR_Pos)            /* (HMATRIXB_PRAS) Master 3 Priority Mask */
#define HMATRIXB_PRAS_M3PR(value)             (HMATRIXB_PRAS_M3PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M3PR_Pos)) /* Assignment of value for M3PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M4PR_Pos                _UINT32_(16)                                         /* (HMATRIXB_PRAS) Master 4 Priority Position */
#define HMATRIXB_PRAS_M4PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M4PR_Pos)            /* (HMATRIXB_PRAS) Master 4 Priority Mask */
#define HMATRIXB_PRAS_M4PR(value)             (HMATRIXB_PRAS_M4PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M4PR_Pos)) /* Assignment of value for M4PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M5PR_Pos                _UINT32_(20)                                         /* (HMATRIXB_PRAS) Master 5 Priority Position */
#define HMATRIXB_PRAS_M5PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M5PR_Pos)            /* (HMATRIXB_PRAS) Master 5 Priority Mask */
#define HMATRIXB_PRAS_M5PR(value)             (HMATRIXB_PRAS_M5PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M5PR_Pos)) /* Assignment of value for M5PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M6PR_Pos                _UINT32_(24)                                         /* (HMATRIXB_PRAS) Master 6 Priority Position */
#define HMATRIXB_PRAS_M6PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M6PR_Pos)            /* (HMATRIXB_PRAS) Master 6 Priority Mask */
#define HMATRIXB_PRAS_M6PR(value)             (HMATRIXB_PRAS_M6PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M6PR_Pos)) /* Assignment of value for M6PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_M7PR_Pos                _UINT32_(28)                                         /* (HMATRIXB_PRAS) Master 7 Priority Position */
#define HMATRIXB_PRAS_M7PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRAS_M7PR_Pos)            /* (HMATRIXB_PRAS) Master 7 Priority Mask */
#define HMATRIXB_PRAS_M7PR(value)             (HMATRIXB_PRAS_M7PR_Msk & (_UINT32_(value) << HMATRIXB_PRAS_M7PR_Pos)) /* Assignment of value for M7PR in the HMATRIXB_PRAS register */
#define HMATRIXB_PRAS_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (HMATRIXB_PRAS) Register Mask  */


/* -------- HMATRIXB_PRBS : (HMATRIXB Offset: 0x04) (R/W 32) Priority B for Slave -------- */
#define HMATRIXB_PRBS_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIXB_PRBS) Priority B for Slave  Reset Value */

#define HMATRIXB_PRBS_M8PR_Pos                _UINT32_(0)                                          /* (HMATRIXB_PRBS) Master 8 Priority Position */
#define HMATRIXB_PRBS_M8PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRBS_M8PR_Pos)            /* (HMATRIXB_PRBS) Master 8 Priority Mask */
#define HMATRIXB_PRBS_M8PR(value)             (HMATRIXB_PRBS_M8PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M8PR_Pos)) /* Assignment of value for M8PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M9PR_Pos                _UINT32_(4)                                          /* (HMATRIXB_PRBS) Master 9 Priority Position */
#define HMATRIXB_PRBS_M9PR_Msk                (_UINT32_(0xF) << HMATRIXB_PRBS_M9PR_Pos)            /* (HMATRIXB_PRBS) Master 9 Priority Mask */
#define HMATRIXB_PRBS_M9PR(value)             (HMATRIXB_PRBS_M9PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M9PR_Pos)) /* Assignment of value for M9PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M10PR_Pos               _UINT32_(8)                                          /* (HMATRIXB_PRBS) Master 10 Priority Position */
#define HMATRIXB_PRBS_M10PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M10PR_Pos)           /* (HMATRIXB_PRBS) Master 10 Priority Mask */
#define HMATRIXB_PRBS_M10PR(value)            (HMATRIXB_PRBS_M10PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M10PR_Pos)) /* Assignment of value for M10PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M11PR_Pos               _UINT32_(12)                                         /* (HMATRIXB_PRBS) Master 11 Priority Position */
#define HMATRIXB_PRBS_M11PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M11PR_Pos)           /* (HMATRIXB_PRBS) Master 11 Priority Mask */
#define HMATRIXB_PRBS_M11PR(value)            (HMATRIXB_PRBS_M11PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M11PR_Pos)) /* Assignment of value for M11PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M12PR_Pos               _UINT32_(16)                                         /* (HMATRIXB_PRBS) Master 12 Priority Position */
#define HMATRIXB_PRBS_M12PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M12PR_Pos)           /* (HMATRIXB_PRBS) Master 12 Priority Mask */
#define HMATRIXB_PRBS_M12PR(value)            (HMATRIXB_PRBS_M12PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M12PR_Pos)) /* Assignment of value for M12PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M13PR_Pos               _UINT32_(20)                                         /* (HMATRIXB_PRBS) Master 13 Priority Position */
#define HMATRIXB_PRBS_M13PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M13PR_Pos)           /* (HMATRIXB_PRBS) Master 13 Priority Mask */
#define HMATRIXB_PRBS_M13PR(value)            (HMATRIXB_PRBS_M13PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M13PR_Pos)) /* Assignment of value for M13PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M14PR_Pos               _UINT32_(24)                                         /* (HMATRIXB_PRBS) Master 14 Priority Position */
#define HMATRIXB_PRBS_M14PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M14PR_Pos)           /* (HMATRIXB_PRBS) Master 14 Priority Mask */
#define HMATRIXB_PRBS_M14PR(value)            (HMATRIXB_PRBS_M14PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M14PR_Pos)) /* Assignment of value for M14PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_M15PR_Pos               _UINT32_(28)                                         /* (HMATRIXB_PRBS) Master 15 Priority Position */
#define HMATRIXB_PRBS_M15PR_Msk               (_UINT32_(0xF) << HMATRIXB_PRBS_M15PR_Pos)           /* (HMATRIXB_PRBS) Master 15 Priority Mask */
#define HMATRIXB_PRBS_M15PR(value)            (HMATRIXB_PRBS_M15PR_Msk & (_UINT32_(value) << HMATRIXB_PRBS_M15PR_Pos)) /* Assignment of value for M15PR in the HMATRIXB_PRBS register */
#define HMATRIXB_PRBS_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (HMATRIXB_PRBS) Register Mask  */


/* -------- HMATRIXB_MCFG : (HMATRIXB Offset: 0x00) (R/W 32) Master Configuration -------- */
#define HMATRIXB_MCFG_RESETVALUE              _UINT32_(0x02)                                       /*  (HMATRIXB_MCFG) Master Configuration  Reset Value */

#define HMATRIXB_MCFG_ULBT_Pos                _UINT32_(0)                                          /* (HMATRIXB_MCFG) Undefined Length Burst Type Position */
#define HMATRIXB_MCFG_ULBT_Msk                (_UINT32_(0x7) << HMATRIXB_MCFG_ULBT_Pos)            /* (HMATRIXB_MCFG) Undefined Length Burst Type Mask */
#define HMATRIXB_MCFG_ULBT(value)             (HMATRIXB_MCFG_ULBT_Msk & (_UINT32_(value) << HMATRIXB_MCFG_ULBT_Pos)) /* Assignment of value for ULBT in the HMATRIXB_MCFG register */
#define   HMATRIXB_MCFG_ULBT_INFINITE_Val     _UINT32_(0x0)                                        /* (HMATRIXB_MCFG) Infinite Length  */
#define   HMATRIXB_MCFG_ULBT_SINGLE_Val       _UINT32_(0x1)                                        /* (HMATRIXB_MCFG) Single Access  */
#define   HMATRIXB_MCFG_ULBT_FOUR_BEAT_Val    _UINT32_(0x2)                                        /* (HMATRIXB_MCFG) Four Beat Burst  */
#define   HMATRIXB_MCFG_ULBT_EIGHT_BEAT_Val   _UINT32_(0x3)                                        /* (HMATRIXB_MCFG) Eight Beat Burst  */
#define   HMATRIXB_MCFG_ULBT_SIXTEEN_BEAT_Val _UINT32_(0x4)                                        /* (HMATRIXB_MCFG) Sixteen Beat Burst  */
#define HMATRIXB_MCFG_ULBT_INFINITE           (HMATRIXB_MCFG_ULBT_INFINITE_Val << HMATRIXB_MCFG_ULBT_Pos) /* (HMATRIXB_MCFG) Infinite Length Position */
#define HMATRIXB_MCFG_ULBT_SINGLE             (HMATRIXB_MCFG_ULBT_SINGLE_Val << HMATRIXB_MCFG_ULBT_Pos) /* (HMATRIXB_MCFG) Single Access Position */
#define HMATRIXB_MCFG_ULBT_FOUR_BEAT          (HMATRIXB_MCFG_ULBT_FOUR_BEAT_Val << HMATRIXB_MCFG_ULBT_Pos) /* (HMATRIXB_MCFG) Four Beat Burst Position */
#define HMATRIXB_MCFG_ULBT_EIGHT_BEAT         (HMATRIXB_MCFG_ULBT_EIGHT_BEAT_Val << HMATRIXB_MCFG_ULBT_Pos) /* (HMATRIXB_MCFG) Eight Beat Burst Position */
#define HMATRIXB_MCFG_ULBT_SIXTEEN_BEAT       (HMATRIXB_MCFG_ULBT_SIXTEEN_BEAT_Val << HMATRIXB_MCFG_ULBT_Pos) /* (HMATRIXB_MCFG) Sixteen Beat Burst Position */
#define HMATRIXB_MCFG_Msk                     _UINT32_(0x00000007)                                 /* (HMATRIXB_MCFG) Register Mask  */


