Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_jh_vl_cnano/pic32cm_jh_vl_cnano_mikroe_click/mcp25625/firmware/src/packs/PIC32CM6408JH00064_DFP/component/hmatrixb.h
/* -------- HMATRIXB_SCFG : (HMATRIXB Offset: 0x40) (R/W 32) Slave Configuration -------- */
#define HMATRIXB_SCFG_RESETVALUE              _UINT32_(0x10)                                       /*  (HMATRIXB_SCFG) Slave Configuration  Reset Value */

#define HMATRIXB_SCFG_SLOT_CYCLE_Pos          _UINT32_(0)                                          /* (HMATRIXB_SCFG) Maximum Number of Allowed Cycles for a Burst Position */
#define HMATRIXB_SCFG_SLOT_CYCLE_Msk          (_UINT32_(0xFF) << HMATRIXB_SCFG_SLOT_CYCLE_Pos)     /* (HMATRIXB_SCFG) Maximum Number of Allowed Cycles for a Burst Mask */
#define HMATRIXB_SCFG_SLOT_CYCLE(value)       (HMATRIXB_SCFG_SLOT_CYCLE_Msk & (_UINT32_(value) << HMATRIXB_SCFG_SLOT_CYCLE_Pos)) /* Assignment of value for SLOT_CYCLE in the HMATRIXB_SCFG register */
#define HMATRIXB_SCFG_DEFMSTR_TYPE_Pos        _UINT32_(16)                                         /* (HMATRIXB_SCFG) Default Master Type Position */
#define HMATRIXB_SCFG_DEFMSTR_TYPE_Msk        (_UINT32_(0x3) << HMATRIXB_SCFG_DEFMSTR_TYPE_Pos)    /* (HMATRIXB_SCFG) Default Master Type Mask */
#define HMATRIXB_SCFG_DEFMSTR_TYPE(value)     (HMATRIXB_SCFG_DEFMSTR_TYPE_Msk & (_UINT32_(value) << HMATRIXB_SCFG_DEFMSTR_TYPE_Pos)) /* Assignment of value for DEFMSTR_TYPE in the HMATRIXB_SCFG register */
#define   HMATRIXB_SCFG_DEFMSTR_TYPE_NO_DEFAULT_Val _UINT32_(0x0)                                        /* (HMATRIXB_SCFG) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst.  */
#define   HMATRIXB_SCFG_DEFMSTR_TYPE_LAST_DEFAULT_Val _UINT32_(0x1)                                        /* (HMATRIXB_SCFG) Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave.  */
#define   HMATRIXB_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT_Val _UINT32_(0x2)                                        /* (HMATRIXB_SCFG) Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave.  */
#define HMATRIXB_SCFG_DEFMSTR_TYPE_NO_DEFAULT (HMATRIXB_SCFG_DEFMSTR_TYPE_NO_DEFAULT_Val << HMATRIXB_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIXB_SCFG) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst. Position */
#define HMATRIXB_SCFG_DEFMSTR_TYPE_LAST_DEFAULT (HMATRIXB_SCFG_DEFMSTR_TYPE_LAST_DEFAULT_Val << HMATRIXB_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIXB_SCFG) Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave. Position */
#define HMATRIXB_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT (HMATRIXB_SCFG_DEFMSTR_TYPE_FIXED_DEFAULT_Val << HMATRIXB_SCFG_DEFMSTR_TYPE_Pos) /* (HMATRIXB_SCFG) Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave. Position */
#define HMATRIXB_SCFG_FIXED_DEFMSTR_Pos       _UINT32_(18)                                         /* (HMATRIXB_SCFG) Fixed Index of Default Master Position */
#define HMATRIXB_SCFG_FIXED_DEFMSTR_Msk       (_UINT32_(0xF) << HMATRIXB_SCFG_FIXED_DEFMSTR_Pos)   /* (HMATRIXB_SCFG) Fixed Index of Default Master Mask */
#define HMATRIXB_SCFG_FIXED_DEFMSTR(value)    (HMATRIXB_SCFG_FIXED_DEFMSTR_Msk & (_UINT32_(value) << HMATRIXB_SCFG_FIXED_DEFMSTR_Pos)) /* Assignment of value for FIXED_DEFMSTR in the HMATRIXB_SCFG register */
#define HMATRIXB_SCFG_ARBT_Pos                _UINT32_(24)                                         /* (HMATRIXB_SCFG) Arbitration Type Position */
#define HMATRIXB_SCFG_ARBT_Msk                (_UINT32_(0x1) << HMATRIXB_SCFG_ARBT_Pos)            /* (HMATRIXB_SCFG) Arbitration Type Mask */
#define HMATRIXB_SCFG_ARBT(value)             (HMATRIXB_SCFG_ARBT_Msk & (_UINT32_(value) << HMATRIXB_SCFG_ARBT_Pos)) /* Assignment of value for ARBT in the HMATRIXB_SCFG register */
#define   HMATRIXB_SCFG_ARBT_ROUND_ROBIN_Val  _UINT32_(0x0)                                        /* (HMATRIXB_SCFG) Round-Robin Arbitration  */
#define   HMATRIXB_SCFG_ARBT_FIXED_PRIORITY_Val _UINT32_(0x1)                                        /* (HMATRIXB_SCFG) Fixed Priority Arbitration  */
#define HMATRIXB_SCFG_ARBT_ROUND_ROBIN        (HMATRIXB_SCFG_ARBT_ROUND_ROBIN_Val << HMATRIXB_SCFG_ARBT_Pos) /* (HMATRIXB_SCFG) Round-Robin Arbitration Position */
#define HMATRIXB_SCFG_ARBT_FIXED_PRIORITY     (HMATRIXB_SCFG_ARBT_FIXED_PRIORITY_Val << HMATRIXB_SCFG_ARBT_Pos) /* (HMATRIXB_SCFG) Fixed Priority Arbitration Position */
#define HMATRIXB_SCFG_Msk                     _UINT32_(0x013F00FF)                                 /* (HMATRIXB_SCFG) Register Mask  */


/* -------- HMATRIXB_MRCR : (HMATRIXB Offset: 0x100) (R/W 32) Master Remap Control -------- */
#define HMATRIXB_MRCR_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIXB_MRCR) Master Remap Control  Reset Value */

#define HMATRIXB_MRCR_RCB0_Pos                _UINT32_(0)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 0 Position */
#define HMATRIXB_MRCR_RCB0_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB0_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 0 Mask */
#define HMATRIXB_MRCR_RCB0(value)             (HMATRIXB_MRCR_RCB0_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB0_Pos)) /* Assignment of value for RCB0 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB0_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB0_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB0_DIS                (HMATRIXB_MRCR_RCB0_DIS_Val << HMATRIXB_MRCR_RCB0_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB0_ENA                (HMATRIXB_MRCR_RCB0_ENA_Val << HMATRIXB_MRCR_RCB0_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB1_Pos                _UINT32_(1)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 1 Position */
#define HMATRIXB_MRCR_RCB1_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB1_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 1 Mask */
#define HMATRIXB_MRCR_RCB1(value)             (HMATRIXB_MRCR_RCB1_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB1_Pos)) /* Assignment of value for RCB1 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB1_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB1_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB1_DIS                (HMATRIXB_MRCR_RCB1_DIS_Val << HMATRIXB_MRCR_RCB1_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB1_ENA                (HMATRIXB_MRCR_RCB1_ENA_Val << HMATRIXB_MRCR_RCB1_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB2_Pos                _UINT32_(2)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 2 Position */
#define HMATRIXB_MRCR_RCB2_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB2_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 2 Mask */
#define HMATRIXB_MRCR_RCB2(value)             (HMATRIXB_MRCR_RCB2_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB2_Pos)) /* Assignment of value for RCB2 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB2_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB2_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB2_DIS                (HMATRIXB_MRCR_RCB2_DIS_Val << HMATRIXB_MRCR_RCB2_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB2_ENA                (HMATRIXB_MRCR_RCB2_ENA_Val << HMATRIXB_MRCR_RCB2_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB3_Pos                _UINT32_(3)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 3 Position */
#define HMATRIXB_MRCR_RCB3_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB3_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 3 Mask */
#define HMATRIXB_MRCR_RCB3(value)             (HMATRIXB_MRCR_RCB3_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB3_Pos)) /* Assignment of value for RCB3 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB3_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB3_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB3_DIS                (HMATRIXB_MRCR_RCB3_DIS_Val << HMATRIXB_MRCR_RCB3_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB3_ENA                (HMATRIXB_MRCR_RCB3_ENA_Val << HMATRIXB_MRCR_RCB3_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB4_Pos                _UINT32_(4)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 4 Position */
#define HMATRIXB_MRCR_RCB4_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB4_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 4 Mask */
#define HMATRIXB_MRCR_RCB4(value)             (HMATRIXB_MRCR_RCB4_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB4_Pos)) /* Assignment of value for RCB4 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB4_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB4_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB4_DIS                (HMATRIXB_MRCR_RCB4_DIS_Val << HMATRIXB_MRCR_RCB4_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB4_ENA                (HMATRIXB_MRCR_RCB4_ENA_Val << HMATRIXB_MRCR_RCB4_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB5_Pos                _UINT32_(5)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 5 Position */
#define HMATRIXB_MRCR_RCB5_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB5_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 5 Mask */
#define HMATRIXB_MRCR_RCB5(value)             (HMATRIXB_MRCR_RCB5_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB5_Pos)) /* Assignment of value for RCB5 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB5_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB5_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB5_DIS                (HMATRIXB_MRCR_RCB5_DIS_Val << HMATRIXB_MRCR_RCB5_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB5_ENA                (HMATRIXB_MRCR_RCB5_ENA_Val << HMATRIXB_MRCR_RCB5_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB6_Pos                _UINT32_(6)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 6 Position */
#define HMATRIXB_MRCR_RCB6_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB6_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 6 Mask */
#define HMATRIXB_MRCR_RCB6(value)             (HMATRIXB_MRCR_RCB6_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB6_Pos)) /* Assignment of value for RCB6 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB6_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB6_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB6_DIS                (HMATRIXB_MRCR_RCB6_DIS_Val << HMATRIXB_MRCR_RCB6_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB6_ENA                (HMATRIXB_MRCR_RCB6_ENA_Val << HMATRIXB_MRCR_RCB6_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB7_Pos                _UINT32_(7)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 7 Position */
#define HMATRIXB_MRCR_RCB7_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB7_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 7 Mask */
#define HMATRIXB_MRCR_RCB7(value)             (HMATRIXB_MRCR_RCB7_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB7_Pos)) /* Assignment of value for RCB7 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB7_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB7_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB7_DIS                (HMATRIXB_MRCR_RCB7_DIS_Val << HMATRIXB_MRCR_RCB7_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB7_ENA                (HMATRIXB_MRCR_RCB7_ENA_Val << HMATRIXB_MRCR_RCB7_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB8_Pos                _UINT32_(8)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 8 Position */
#define HMATRIXB_MRCR_RCB8_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB8_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 8 Mask */
#define HMATRIXB_MRCR_RCB8(value)             (HMATRIXB_MRCR_RCB8_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB8_Pos)) /* Assignment of value for RCB8 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB8_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB8_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB8_DIS                (HMATRIXB_MRCR_RCB8_DIS_Val << HMATRIXB_MRCR_RCB8_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB8_ENA                (HMATRIXB_MRCR_RCB8_ENA_Val << HMATRIXB_MRCR_RCB8_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB9_Pos                _UINT32_(9)                                          /* (HMATRIXB_MRCR) Remap Command Bit for Master 9 Position */
#define HMATRIXB_MRCR_RCB9_Msk                (_UINT32_(0x1) << HMATRIXB_MRCR_RCB9_Pos)            /* (HMATRIXB_MRCR) Remap Command Bit for Master 9 Mask */
#define HMATRIXB_MRCR_RCB9(value)             (HMATRIXB_MRCR_RCB9_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB9_Pos)) /* Assignment of value for RCB9 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB9_DIS_Val          _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB9_ENA_Val          _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB9_DIS                (HMATRIXB_MRCR_RCB9_DIS_Val << HMATRIXB_MRCR_RCB9_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB9_ENA                (HMATRIXB_MRCR_RCB9_ENA_Val << HMATRIXB_MRCR_RCB9_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB10_Pos               _UINT32_(10)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 10 Position */
#define HMATRIXB_MRCR_RCB10_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB10_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 10 Mask */
#define HMATRIXB_MRCR_RCB10(value)            (HMATRIXB_MRCR_RCB10_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB10_Pos)) /* Assignment of value for RCB10 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB10_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB10_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB10_DIS               (HMATRIXB_MRCR_RCB10_DIS_Val << HMATRIXB_MRCR_RCB10_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB10_ENA               (HMATRIXB_MRCR_RCB10_ENA_Val << HMATRIXB_MRCR_RCB10_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB11_Pos               _UINT32_(11)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 11 Position */
#define HMATRIXB_MRCR_RCB11_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB11_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 11 Mask */
#define HMATRIXB_MRCR_RCB11(value)            (HMATRIXB_MRCR_RCB11_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB11_Pos)) /* Assignment of value for RCB11 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB11_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB11_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB11_DIS               (HMATRIXB_MRCR_RCB11_DIS_Val << HMATRIXB_MRCR_RCB11_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB11_ENA               (HMATRIXB_MRCR_RCB11_ENA_Val << HMATRIXB_MRCR_RCB11_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB12_Pos               _UINT32_(12)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 12 Position */
#define HMATRIXB_MRCR_RCB12_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB12_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 12 Mask */
#define HMATRIXB_MRCR_RCB12(value)            (HMATRIXB_MRCR_RCB12_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB12_Pos)) /* Assignment of value for RCB12 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB12_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB12_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB12_DIS               (HMATRIXB_MRCR_RCB12_DIS_Val << HMATRIXB_MRCR_RCB12_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB12_ENA               (HMATRIXB_MRCR_RCB12_ENA_Val << HMATRIXB_MRCR_RCB12_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB13_Pos               _UINT32_(13)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 13 Position */
#define HMATRIXB_MRCR_RCB13_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB13_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 13 Mask */
#define HMATRIXB_MRCR_RCB13(value)            (HMATRIXB_MRCR_RCB13_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB13_Pos)) /* Assignment of value for RCB13 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB13_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB13_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB13_DIS               (HMATRIXB_MRCR_RCB13_DIS_Val << HMATRIXB_MRCR_RCB13_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB13_ENA               (HMATRIXB_MRCR_RCB13_ENA_Val << HMATRIXB_MRCR_RCB13_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB14_Pos               _UINT32_(14)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 14 Position */
#define HMATRIXB_MRCR_RCB14_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB14_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 14 Mask */
#define HMATRIXB_MRCR_RCB14(value)            (HMATRIXB_MRCR_RCB14_Msk & (_UINT32_(value) << HMATRIXB_MRCR_RCB14_Pos)) /* Assignment of value for RCB14 in the HMATRIXB_MRCR register */
#define   HMATRIXB_MRCR_RCB14_DIS_Val         _UINT32_(0x0)                                        /* (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB14_ENA_Val         _UINT32_(0x1)                                        /* (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB14_DIS               (HMATRIXB_MRCR_RCB14_DIS_Val << HMATRIXB_MRCR_RCB14_Pos) /* (HMATRIXB_MRCR) Disable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB14_ENA               (HMATRIXB_MRCR_RCB14_ENA_Val << HMATRIXB_MRCR_RCB14_Pos) /* (HMATRIXB_MRCR) Enable remapped address decoding for master Position */
#define HMATRIXB_MRCR_RCB15_Pos               _UINT32_(15)                                         /* (HMATRIXB_MRCR) Remap Command Bit for Master 15 Position */
#define HMATRIXB_MRCR_RCB15_Msk               (_UINT32_(0x1) << HMATRIXB_MRCR_RCB15_Pos)           /* (HMATRIXB_MRCR) Remap Command Bit for Master 15 Mask */
